============================================================================
=                               df1 1.0.0                      23/01/2003  =
=                                                                          =
=           This software is Copyright (C) 2003 by Stephane LEICHT         =
=      Use this software at your own risk. I am not responsible for        =
=            anything this software may do to your computer.               =
=     This software falls under the GNU Public License.                    =
============================================================================


======================================
 Author
======================================

Author: Stephane LEICHT
e-mail: leicht@tuxplc.net
homepage: http://www.tuxplc.net


======================================
 Requirements
======================================
  a SLC500 or micrologix connected on the serial port.


======================================
 Install
======================================

  Compilation: make

  install :      copy df1 in /usr/bin
                 copy df1d in /etc/init.d

======================================
 Features
======================================
        This program is a daemon to communicate with ethernet TCPIP from programmable logic
controller SLC500 and MicroLogix ALLEN-BRADLEY connected on the serial port
(df1).
	This program is free software and is provided under terms of the GNU
Public License. That's mean you can redistribute it and/or modify it under
the terms of the GNU Library General Public License as published by the Free
Software Foundation, either version 2 of the License, or (at your option)
any later version. This program is distributed in the hope that it will be
useful, but WITHOUT ANY WARRANTY. See the GNU Library General Public
License.


======================================
 Getting started
======================================
       start df1 daemon with the script df1d > /etc/init.d/df1d start

       open a telnet session > telnet localhost 17560

       read integer value in SLC500 >   N7:1
       write integer value in SLC500 >  N7:1=456
                                        T4:0.PRE=15

       read float value in SLC500 >     F8:5
       write float value in SLC500 >    F8:2=-3.14
                                        F8:1=5E-4
                                        F8:0=7.001

       read boolean value in SLC500 >   B3:0/5
                                        T4:0.dn
       write boolean value in SLC500 >  B3:0/5=1
                                        B3:0/4=0

       you can view logs in /var/log/syslog.
